Revit 2026 API

# PartUtilsAreElementsValidForCreateParts Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreElementsValidForCreateParts(
	Document document,
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function AreElementsValidForCreateParts (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool AreElementsValidForCreateParts(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member AreElementsValidForCreateParts :
        document : Document *
        elementIds : ICollection<ElementId> -> bool
```

#### Parameters

document Document

elementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace